Tester1cExpansion/src/InformationRegisters/Tester_ШаблонныеДанные/Tester_ШаблонныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Tester_ШаблонныеДанные</name>
  <resources>
    <name>ХранилищеШаблонныхДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>UIDОбъекта</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester1cExpansion/src/InformationRegisters/Tester_ШаблонныеДанные/ManagerModule.bsl
Функция ЗаписатьШаблонныеДанныеОбъекта (Знач ФиксированныеПараметры,МодифицируемыеПараметры) ЭКСПОРТ
	
	UIDОбъекта = ФиксированныеПараметры.UIDОбъекта;
	ХранилищеШаблонныхДанных = ФиксированныеПараметры.ХранилищеШаблонныхДанных;
	
	НаборЗаписей = РегистрыСведений.Tester_ШаблонныеДанные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.UIDОбъекта.Установить(UIDОбъекта);
	
	нЗапись = НаборЗаписей.Добавить();
	нЗапись.UIDОбъекта = UIDОбъекта;
	нЗапись.ХранилищеШаблонныхДанных = ХранилищеШаблонныхДанных;
	
	Попытка
		НаборЗаписей.Записать(Истина);	
		Возврат Истина;
	Исключение
		СообщениеОшибки = ОписаниеОшибки();		
		МодифицируемыеПараметры.Вставить("СообщениеОшибки",СообщениеОшибки);
		Возврат Ложь;		
	КонецПопытки;
	
КонецФункции

Функция ПолучитьШаблонныеДанныеОбъекта(Знач ФиксированныеПараметры,МодифицируемыеПараметры) ЭКСПОРТ
	UIDОбъекта = ФиксированныеПараметры.UIDОбъекта;
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("UIDОбъекта",UIDОбъекта);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Tester_ШаблонныеДанные.ХранилищеШаблонныхДанных КАК ХранилищеШаблонныхДанных
	               |ИЗ
	               |	РегистрСведений.Tester_ШаблонныеДанные КАК Tester_ШаблонныеДанные
	               |ГДЕ
	               |	Tester_ШаблонныеДанные.UIDОбъекта = &UIDОбъекта";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.ХранилищеШаблонныхДанных;
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции
